tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "netlify/netlifyctl"
tap "remind101/formulae"
tap "universal-ctags/universal-ctags"
cask "java8"
brew "asciinema"
brew "awscli"
brew "circleci"
brew "diff-so-fancy"
brew "elixir"
brew "erlang"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "go"
brew "hub"
brew "httpie"
brew "less"
brew "mas"
brew "netlifyctl"
brew "neovim"
brew "openssl"
brew "python"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "ruby", link: true
brew "Schniz/tap/fnm"
brew "terraform"
brew "tig"
brew "tmux"
brew "universal-ctags", args: ["HEAD"]
brew "vim"
brew "watchman"
brew "zplug"
brew "zsh"
brew "remind101/formulae/assume-role"
cask "1password"
cask "alfred"
cask "discord"
cask "docker"
cask "github"
cask "google-backup-and-sync"
cask "google-chrome"
cask "iterm2"
cask "java"
cask "karabiner-elements"
cask "keybase"
cask "marshallofsound-google-play-music-player"
cask "mongodb"
cask "paw"
cask "postman"
cask "slack"
cask "steam"
cask "visual-studio-code"
cask "vlc"
mas "Contrast", id: 1254981365
mas "Focus Matrix", id: 1087284172
mas "Be Focused Pro", id: 961632517
mas "iA Writer", id: 775737590
mas "Keynote", id: 409183694
mas "Markoff", id: 1084713122
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Spark", id: 1176895641
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "Todoist", id: 585829637
