Arjun.swagger-viewer
auchenberg.vscode-browser-preview
austenc.tailwind-docs
batisteo.vscode-django
bierner.emojisense
bradlc.vscode-tailwindcss
bungcip.better-toml
CoenraadS.bracket-pair-colorizer-2
cpylua.language-postcss
dbaeumer.vscode-eslint
dkundel.vscode-new-file
donjayamanne.python-extension-pack
eamodio.gitlens
EditorConfig.EditorConfig
erichbehrens.pull-request-monitor
esbenp.prettier-vscode
formulahendry.auto-close-tag
GitHub.vscode-pull-request-github
jolaleye.horizon-theme-vscode
jpoissonnier.vscode-styled-components
karigari.chat
lostintangent.vsls-pomodoro
lostintangent.vsls-whiteboard
magicstack.MagicPython
mikestead.dotenv
ms-azuretools.vscode-docker
ms-python.python
ms-vscode.Go
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
ms-vsliveshare.vsliveshare-pack
msjsdiag.debugger-for-chrome
oderwat.indent-rainbow
piousdeer.horizon-theme-vscode-default-token-colors
Prisma.vscode-graphql
redhat.vscode-yaml
sdras.night-owl
silvenon.mdx
softwaredotcom.swdc-vscode
sveggiani.vscode-field-lights
teabyii.ayu
u29dc.mno
VisualStudioExptTeam.vscodeintellicode
vscode-icons-team.vscode-icons
vscodevim.vim
wholroyd.jinja
